# Shell & Terminal
brew "zsh"
brew "tmux"
brew "starship"         # cross-shell prompt
brew "fastfetch"        # system info display

# File & Text Utilities
brew "eza"              # ls replacement with icons
brew "bat"              # cat with syntax highlighting
brew "yazi"             # terminal file manager
brew "zoxide"           # smart cd
brew "ripgrep"          # fast grep
brew "fd"               # fast find
brew "fzf"              # fuzzy finder
brew "delta"            # git diff viewer
brew "tree"             # directory tree display

# Core Tools
brew "curl"
brew "wget"
brew "git"
brew "unzip"
brew "jq"               # JSON processor
brew "htop"             # process viewer

# macOS Window Management
tap "nikitabobko/tap"
cask "aerospace"
tap "FelixKratz/formulae"
brew "sketchybar"

# Fonts
cask "font-jetbrains-mono-nerd-font"
